-cask_args appdir: '/Applications'

tap "aylei/tap"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "ktr0731/evans"
tap "neovim/neovim"
tap "sanemat/font"

brew "ack"
brew "sqlite"
brew "aria2"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "binutils", link: true
brew "chromedriver"
brew "colordiff"
brew "coreutils"
brew "ctags"
brew "ctop"
brew "curl"
brew "diffutils"
brew "direnv"
brew "ed"
brew "elixir"
brew "findutils", args: ["with-default-names"]
brew "libtool"
brew "mpfr"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "gd"
brew "ghq"
brew "git"
brew "gnu-getopt"
brew "gnu-sed", args: ["with-default-names"]
brew "gnu-tar"
brew "go"
brew "graphviz"
brew "grep", args: ["with-default-names"]
brew "gzip"
brew "helm"
brew "hub"
brew "little-cms2"
brew "imagemagick"
brew "ios-deploy"
brew "jemalloc"
brew "jenv"
brew "oniguruma"
brew "jq"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "less"
brew "libevent"
brew "libsass"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "lua"
brew "lv"
brew "lynx"
brew "make", args: ["with-default-names"]
brew "mas"
brew "maven"
brew "msgpack"
brew "mysql"
brew "ncurses"
brew "neovim"
brew "nkf"
brew "node"
brew "node@6"
brew "nodebrew"
brew "openssh"
brew "openssl@1.1"
brew "peco"
brew "postgresql"
brew "protobuf"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "redis"
brew "rsync"
brew "ruby"
brew "shellcheck"
brew "shtool"
brew "ssh-copy-id"
brew "stern"
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "typescript"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"
brew "aylei/tap/kubectl-debug"
brew "golangci/tap/golangci-lint"
brew "sanemat/font/ricty"
cask "alfred"
cask "android-platform-tools"
cask "atom"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gyazo"
cask "hyperswitch"
cask "iterm2"
cask "kindle"
cask "licecap"
cask "marp"
cask "skitch"
cask "skype"
cask "slack"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"

mas "1Password 7", id: 1333542190
mas "BetterSnapTool", id: 417375580
mas "Red Hot Timer", id: 929960914
mas "Xcode", id: 497799835
