cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'neovim/neovim'

# android
cask 'android-platform-tools'

# sqlite
brew 'sqlite'

# pyenv
brew 'pyenv'
brew 'pyenv-virtualenv'

# ansible
brew 'ansible'
brew 'openssl@1.1'
brew 'python'
brew 'python3'

# docker
brew 'ctop'
cask 'docker'

# protobuf
brew 'protobuf'

# database
brew 'mysql'
brew 'postgresql'

# kubetools
brew 'kube-ps1'
brew 'kubectx'
brew 'kubernetes-cli'

# gnu
brew 'gnu-getopt'
brew 'coreutils'
brew 'diffutils'
brew 'findutils', args: ['with-default-names']
brew 'ed', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'grep', args: ['with-default-names']
brew 'gzip'
brew 'less'
brew 'make', args: ['with-default-names']
brew 'ncurses'
brew 'openssh'
brew 'rsync'
brew 'gawk'
brew 'gmp'
brew 'mpfr'
brew 'binutils'
brew 'openssl'

# graphviz
brew 'graphviz'
brew 'gd'
brew 'webp'

# font
tap 'sanemat/font'
brew 'ricty'
brew 'freetype'
brew 'fontconfig'
brew 'fontforge'
brew 'pixman'
brew 'cairo'
brew 'jpeg'
brew 'gobject-introspection'
brew 'ricty'
brew 'harfbuzz'
brew 'pango'
brew 'terminal-notifier'

# git
brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'gibo'

# basic
brew 'glib'
brew 'autoconf'
brew 'automake'
brew 'libyaml'
brew 'libffi'
brew 'libpng'
brew 'libtiff'
brew 'libtool'
brew 'libmpc'
brew 'libevent'
brew 'libsass'
brew 'libtermkey'
brew 'libuv'
brew 'libvterm'
brew 'libxml2'
brew 'little-cms2'
brew 'pkg-config'
brew 'gettext'
brew 'pcre'

# shell
brew 'bash-completion'
brew 'colordiff'
brew 'ctags'
brew 'curl'
brew 'direnv'
brew 'ghq'
brew 'the_silver_searcher'
brew 'tig'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'zsh', args: ['without-etcdir']
brew 'zsh-completions'
brew 'watch'
brew 'gdbm'
brew 'readline'
brew 'ssh-copy-id'
brew 'openssh'
brew 'ack'

# make
brew 'cmake'
brew 'gcc'
brew 'isl'

# image
brew 'imagemagick'

# javascript
brew 'yarn'
brew 'go'
brew 'xz'
brew 'jenv'
brew 'oniguruma'
brew 'jq'
brew 'jo'
brew 'lua'
brew 'mas'
brew 'msgpack'
brew 'nkf'
brew 'node'
brew 'icu4c'
brew 'peco'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'reattach-to-user-namespace'
brew 'phantomjs'

# redis
brew 'redis'
brew 'jemalloc'

# vim
brew 'vim', args: ['with-lua', 'with-ruby']
brew 'ruby'
brew 'neovim/neovim/neovim'
brew 'unibilium'
brew 'lynx'

# elixir
brew 'elixir'

# cask
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'genymotion'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'iterm2'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'kindle'
cask 'xquartz'
cask 'hyperswitch'
cask 'dash'
cask 'insomniax'
cask 'marp'

# mas
mas 'Kobito', id: 896624060
mas 'BetterSnapTool', id: 417375580
