cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/core'
tap 'neovim/neovim'
tap 'sanemat/font'
cask 'java'
cask 'xquartz'
brew 'android-platform-tools'
brew 'libyaml'
brew 'openssl@1.1'
brew 'gdbm'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'ansible'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'gibo'
brew 'gnu-getopt'
brew 'coreutils'
brew 'diffutils'
brew 'findutils', args: ['--with-default-names']
brew 'ed', args: ['--with-default-names']
brew 'gnu-sed', args: ['--with-default-names']
brew 'gnu-tar', args: ['--with-default-names']
brew 'grep', args: ['--with-default-names']
brew 'gzip'
brew 'less'
brew 'make'
brew 'ncurses'
brew 'openssh'
brew 'rsync'
brew 'gawk'
brew 'graphviz'
brew 'gd'
brew 'webp'
brew 'ricty'
brew 'shellcheck'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'cairo'
brew 'git'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash-completion'
brew 'binutils'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'curl'
brew 'zeromq'
brew 'czmq'
brew 'direnv'
brew 'doxygen'
brew 'findutils'
brew 'jpeg'
brew 'libtiff'
brew 'yarn'
brew 'libtool'
brew 'icu4c'
brew 'harfbuzz'
brew 'pango'
brew 'fontforge'
brew 'gmp'
brew 'isl'
brew 'mpfr'
brew 'libmpc'
brew 'gcc'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'ghq'
brew 'go'
brew 'gradle'
brew 'hicolor-icon-theme'
brew 'gtk+'
brew 'heroku'
brew 'hub'
brew 'xz'
brew 'imagemagick'
brew 'jemalloc'
brew 'jenv'
brew 'oniguruma'
brew 'jq'
brew 'libevent'
brew 'libsass'
brew 'libtermkey'
brew 'libuv'
brew 'libvterm'
brew 'libxml2'
brew 'little-cms2'
brew 'lua'
brew 'mas'
brew 'mecab'
brew 'mecab-ipadic'
brew 'mercurial'
brew 'mono'
brew 'msgpack'
brew 'mysql'
brew 'nkf'
brew 'node'
brew 'openjpeg'
brew 'p7zip'
brew 'peco'
brew 'poppler'
brew 'python3'
brew 'postgresql'
brew 'pyenv'
brew 'ruby-build', args: ['HEAD']
brew 'rbenv', args: ['HEAD']
brew 'rbenv-default-gems'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ruby'
brew 'sassc'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unibilium'
brew 'vim', args: ['with-lua']
brew 'wget'
brew 'zsh', args: ['without-etcdir']
brew 'zsh-completions'
brew 'watch'
brew 'neovim/neovim/neovim'
brew 'sanemat/font/ricty'
cask 'alfred'
cask 'atom'
cask 'caffeine'
cask 'genymotion'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'gyazo'
cask 'iterm2'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'kindle'
cask 'docker-toolbox'
mas 'Kobito', id: 896624060
mas 'BetterSnapTool', id: 417375580
